sde3.log: displays the SWI-Prolog session in which mu was tested 10 times.
Copyright (C) 2017  Nick Barrs

This file is part of SDE3.

SDE3 is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.

Feel free to contact me with questions/concerns at any time
via e-mail at nbarrs@g.clemson.edu
via paper mail at 111 Cochran Rd Apt 702B Clemson, SC 29631
--------------------------------------------------------------------------

?- ['sde3.pro'].
true.

?- mu(((1,3), [(1, 0.0), (2, 1.0), (3, 1.0)])).
true.

?- mu(((1,3), [(1, 0.0), (2, 1.0), (2, 0.5), (3, 1.0)])).
false.

?- mu(((1,4), [(1, 0.0), (2, 1.0), (2, 0.5), (4, 1.0)])).
false.

?- mu(((1,4), [(1, 0.0), (2, 1.0), (3, 0.5), (4, 1.0)])).
true.

?- mu(((1, 7), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7, 0.3)])).
true.

?- mu(((1, 7), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7.0, 0.3)])).
false.

?- mu(((1, 1), [])).
false.

?- mu(((1, 1), [(1, 0.0)])).
true.

?- mu(((2,5), [(2, 0.0), (3, 1.0), (4, 0.5), (5, 1.1)])).
false.

?- mu(((2,5), [(2, 0.0), (3, 1.0), (4, 0.5), (5.0, 1.1)])).
false.
